(function () {
    'use strict';
  
      //発火はレコード作成画面表示時、レコード編集画面を表示した後のイベントです
    kintone.events.on(['app.record.create.submit', 'app.record.edit.submit'], function (event){
  
    var record = event.record;

      //レコード内のオブジェクトを取得します。
      var recordobject = event['record'];
      
      //テキストチェックを行うフィールドの値を変数textへ代入します
      var text = recordobject['textcheck'].value;

      //変換対象の環境依存文字を定義します  
      var ngchr = [
          '①','②','③','④','⑤','⑥','⑦','⑧','⑨','⑩','⑪',
          '⑫','⑬','⑭','⑮','⑯','⑰','⑱','⑲','⑳',
          'Ⅰ','Ⅱ','Ⅲ','Ⅳ','Ⅴ','Ⅵ ','Ⅶ',' Ⅷ','Ⅸ','Ⅹ',
          'ⅰ','ⅱ','ⅲ','ⅳ','ⅴ','ⅵ','ⅶ','ⅷ','ⅸ','ⅹ',
          '㍉','㌔','㌢','㍍','㌘','㌧','㌃','㌶','㍑','㍗',
          '㌍','㌦','㌣','㌫','㍊','㌻','㎜','㎝',
          ' ㎞','㎎','㎏','㏄','㎡','㍻','〝','〟','№','㏍','℡',
          '㊤','㊥','㊦','㊧','㊨','㈱','㈲','㈹','㍾','㍽','㍼'
      ];
      
       //環境依存文字に対応する変換後の非環境依存文字を定義します
      var trnchr = [
          '(1)','(2)','(3)','(4)','(5)','(6)','(7)','(8)','(9)','(10)',
          '(11)','(12)','(13)','(14)','(15)','(16)','(17)','(18)','(19)','(20)',
          'I','II','III','IV','V','VI','VII','VIII','IX','X',
          'i','ii','iii','iv','v','vi','vii','viii','ix','x',
          'ミリ','キロ','センチ','メートル','グラム','トン','アール','ヘクタール','リットル','ワット',
          'カロリー','ドル','セント','パーセント','ミリバール','ページ','mm','cm',
          'km','mg','kg','cc','平方メートル','平成','「','」','No.','K.K.','TEL',
          '(上)','(中)','(下)','(左)','(右)','(株)','(有)','(代)','明治','大正','昭和',
      ];
      
       //変数text内にある環境依存文字を非環境依存文字へと置換します 
      for(var i=0; i<=ngchr.length;i++){
          text = text.replace( ngchr[i], trnchr[i] );
      }
      
  　　//テキストチェックを行うフィールドに値を出力し、従来の値を読み込みが可能な形に変換します
      record['textcheck'].value = text; 

    return event
  
  });
  })();
